Merge pull request #9 from jshraddha-git/patch-1
Revise README for clarity and formatting
